tutorials/eulerVortex.twitch.test-test-test/eulerVortex.cyclic.twitch.moving/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    emptyPatches_empt
    {
        type            empty;
    }
    top_cyc
    {
        type            cyclic;
    }
    bottom_cyc
    {
        type            cyclic;
    }
    inlet_cyc
    {
        type            cyclic;
    }
    outlet_cyc
    {
        type            cyclic;
    }
}


// ************************************************************************* //
