tutorials/eulerVortex.twitch.test-test-test/eulerVortex.cyclic.twitch.moving/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoCentralFoam;//rhoPimpleArbitraryFoam;//meshMoverFoam;//rhoCentralDyMFoam;

startFrom       latestTime;//startTime;

//startTime       0;

stopAt          endTime;

endTime         5.0;

deltaT          1e-03;

writeControl    adjustableRunTime;

writeInterval   1e-02;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1.0;

maxDi           100;

maxDeltaT       .1;

functions
{
    #includeFunc  probes
}

// ************************************************************************* //
